// #1 Числа, кратні 3 чи 5
// Якщо виписати всі натуральні числа менше 10, кратні 3 чи 5, то отримаємо 3, 5, 6 та 9. Сума цих чисел дорівнює 23.
// Знайдіть суму всіх чисел менше 1000, кратних 3 чи 5.

// const firstNumber = 3;
// const secondNumber = 5;
// const maxNumber = 1000;
// let totalSum = 0;

// for (let i = 1; i < maxNumber; i += 1) {
//     if (i % firstNumber !== 0 && i % secondNumber !== 0) {
//         continue;
//     } else {
//         console.log(i);
//         totalSum += i;
//     }
// }
// console.log(totalSum);


// ==============================================
// #2 Парні числа Фібоначчі
// Кожен наступний елемент ряду Фібоначчі виходить при складанні двох попередніх.Починаючи з 1 та 2, перші 10 елементів будуть:

// 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

// Знайдіть суму всіх парних елементів ряду Фібоначчі, які не перевищують чотирьох мільйонів.



// ==============================================
// №3
// Прості дільники числа 13195 – це 5, 7, 13 та 29. Який найбільший дільник числа 600851475143 є простим числом?


// ==============================================
// №4
// Число-паліндром з обох сторін (справа ліворуч і ліворуч) читається однаково. Найбільше число-паліндром, одержане множенням двох двоцифрових чисел – 9009 = 91 × 99. Знайдіть найбільший паліндром, одержаний множенням двох трицифрових чисел. Оригінал



// ==============================================
// №5
// 2520 - самое маленькое число, которое делится без остатка на все числа от 1 до 10.
// Какое самое маленькое число делится нацело на все числа от 1 до 20?


// ==============================================
// №6
// Сума квадратів перших десяти натуральних чисел дорівнює
// 1^2 + 2^2 + ... + 102 = 385
// Квадрат суми перших десяти натуральних чисел дорівнює
// (1 + 2 + ... + 10) ^2 = 552 = 3025
// Отже, різниця між сумою квадратів та квадратом суми перших десяти натуральних чисел становить 3025 − 385 = 2640.
// Знайдіть різницю між сумою квадратів і квадратом суми перших ста натуральних чисел.


// ==============================================
// №7
// Виписавши перші шість простих чисел, отримаємо 2, 3, 5, 7, 11 і 13. Очевидно, що 6 просте число - 13.
// Яке число є 10001-м простим числом?


// ==============================================
// №8
// Найбільший добуток чотирьох послідовних цифр у наведеному нижче 1000-значному числі дорівнює 9 × 9 × 8 × 9 = 5832.

// 73167176531330624919225119674426574742355349194934
// 96983520312774506326239578318016984801869478851843
// 85861560789112949495459501737958331952853208805511
// 12540698747158523863050715693290963295227443043557
// 66896648950445244523161731856403098711121722383113
// 62229893423380308135336276614282806444486645238749
// 30358907296290491560440772390713810515859307960866
// 70172427121883998797908792274921901699720888093776
// 65727333001053367881220235421809751254540594752243
// 52584907711670556013604839586446706324415722155397
// 53697817977846174064955149290862569321978468622482
// 83972241375657056057490261407972968652414535100474
// 82166370484403199890008895243450658541227588666881
// 16427171479924442928230863465674813919123162824586
// 17866458359124566529476545682848912883142607690042
// 24219022671055626321111109370544217506941658960408
// 07198403850962455444362981230987879927244284909188
// 84580156166097919133875499200524063689912560717606
// 05886116467109405077541002256983155200055935729725
// 71636269561882670428252483600823257530420752963450

// Знайдіть найбільший добуток тринадцяти послідовних цифр у цьому числі.



// ==============================================
// №9
// Трійка Піфагора - три натуральні числа a < b < c, для яких виконується рівність
// a2 + b2 = c2
// Наприклад, 32 + 42 = 9 + 16 = 25 = 52.
// Існує лише одна трійка Піфагора, для якої a+b+c=1000.
// Знайдіть добуток abc.



// ==============================================
// №10
// Сума простих чисел менша за 10 дорівнює 2 + 3 + 5 + 7 = 17.
// Знайдіть суму всіх простих чисел менше двох мільйонів.


